tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

brew "autojump"
brew "awscli"
brew "bash-completion"
brew "bash-language-server"
brew "bat"
brew "coreutils"
brew "exa"
brew "fswatch"
brew "fzf"
brew "git"
brew "glib"
brew "gnu-sed"
brew "graphviz"
brew "harfbuzz"
brew "heroku/brew/heroku"
brew "jq"
brew "lua-language-server"
brew "mongodb-community"
brew "neovim"
brew "nginx"
brew "postgresql", restart_service: true
brew "pyenv"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
cask "alacritty"
cask "db-browser-for-sqlite"
cask "rectangle"
