tap "fishtown-analytics/dbt"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "act"
brew "autojump"
brew "awscli"
brew "bash-completion"
brew "bat"
brew "gettext"
brew "glib"
brew "coreutils"
brew "exa"
brew "fswatch"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gobject-introspection"
brew "python@3.8"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "hub"
brew "jq"
brew "krb5"
brew "libevent"
brew "lz4"
brew "neovim"
brew "nginx"
brew "postgresql", restart_service: true
brew "r"
brew "ripgrep"
brew "shellcheck"
brew "sphinx-doc"
brew "the_silver_searcher"
brew "tmux"
brew "fishtown-analytics/dbt/dbt"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community-shell"
cask "db-browser-for-sqlite"
cask "rectangle"
